app/controllers/ais_trackings_controller.rb

SELECT "ais_trackings".* FROM "ais_trackings"
---
  def index
    @ais_trackings = AisTracking.all

INSERT INTO "ais_trackings" ("heading", "last_ais_updated_at", "nav_status_code", "vessel_id", "collection_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @ais_tracking = AisTracking.new(ais_tracking_params)

    respond_to do |format|
      if @ais_tracking.save

DELETE FROM "ais_trackings" WHERE "ais_trackings"."id" = $1  [["id", 980190962]]
---
  def destroy
    @ais_tracking.destroy

SELECT  "ais_trackings".* FROM "ais_trackings" WHERE "ais_trackings"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_ais_tracking
      @ais_tracking = AisTracking.find(params[:id])