app/controllers/ais_vessal_destinations_controller.rb

SELECT "ais_vessal_destinations".* FROM "ais_vessal_destinations"
---
  def index
    @ais_vessal_destinations = AisVessalDestination.all

INSERT INTO "ais_vessal_destinations" ("vessel_id", "destination", "draught", "eta", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["vessel_id", 1], ["destination", "MyString"], ["draught", 1.5], ["eta", "2018-03-22 17:43:08"], ["created_at", "2018-03-22 10:50:30.360340"], ["updated_at", "2018-03-22 10:50:30.360340"]]
---
  def create
    @ais_vessal_destination = AisVessalDestination.new(ais_vessal_destination_params)

    respond_to do |format|
      if @ais_vessal_destination.save

DELETE FROM "ais_vessal_destinations" WHERE "ais_vessal_destinations"."id" = $1  [["id", 980190962]]
---
  def destroy
    @ais_vessal_destination.destroy

SELECT  "ais_vessal_destinations".* FROM "ais_vessal_destinations" WHERE "ais_vessal_destinations"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_ais_vessal_destination
      @ais_vessal_destination = AisVessalDestination.find(params[:id])