app/controllers/port_vessels_controller.rb

  def index
    @port_vessels = PortVessel.all
---
SELECT "port_vessels".* FROM "port_vessels"

  def create
    @port_vessel = PortVessel.new(port_vessel_params)

    respond_to do |format|
      if @port_vessel.save
---
INSERT INTO "port_vessels" ("port_id", "vessel_id", "last_position_updated_at", "nav_status_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @port_vessel.destroy
---
DELETE FROM "port_vessels" WHERE "port_vessels"."id" = $1  [["id", 980190962]]

    def set_port_vessel
      @port_vessel = PortVessel.find(params[:id])
---
SELECT  "port_vessels".* FROM "port_vessels" WHERE "port_vessels"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]