app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("user_name", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_name", "tuyet"], ["password", "1234"], ["created_at", "2018-03-26 06:16:38.787236"], ["updated_at", "2018-03-26 06:16:38.787236"]]