app/controllers/vessels_controller.rb

  def index
    @vessels = Vessel.all
---
SELECT "vessels".* FROM "vessels"

  def create
    @vessel = Vessel.new(vessel_params)

    respond_to do |format|
      if @vessel.save
---
INSERT INTO "vessels" ("status", "mmsi", "imo", "name", "callsign", "vessel_type", "vessel_class", "company_id", "line_id", "raw_data", "slug", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update
    respond_to do |format|
      if @vessel.update(vessel_params)
---
UPDATE "vessels" SET "mmsi" = $1, "updated_at" = $2 WHERE "vessels"."id" = $3  [["mmsi", "asdadasdadasdsad"], ["updated_at", "2018-03-22 10:49:59.901968"], ["id", 1]]

  def destroy
    @vessel.destroy
---
DELETE FROM "vessels" WHERE "vessels"."id" = $1  [["id", 1]]

    def set_vessel
      @vessel = Vessel.find(params[:id])
---
SELECT  "vessels".* FROM "vessels" WHERE "vessels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]