app/controllers/welcome_controller.rb

  def login
    user_name = params[:user][:user_name]
    password = params[:user][:password]
    user = User.find_by(user_name: user_name, password: password)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 AND "users"."password" = $2 LIMIT $3  [["user_name", "ee"], ["password", "eee"], ["LIMIT", 1]]